<HTML>
<HEAD>
<TITLE>Guml Reference - Chapter 8</TITLE>
</HEAD>
<BODY BGCOLOR="#FFFFFF">

<FONT SIZE=+3><b>VIII. Primitives</b></FONT>
<p>
<FONT SIZE=+2>
<a href="#basic">Basic</a><br>
<a href="#string">String</a><br>
<a href="#math">Math</a><br>
<a href="#file">File Handling</a><br>
<a href="#email">Sendmail</a><br>
<a href="#adding">Adding</a><br>
</FONT>
<p>
<blockquote>
<a name="basic"><B>Basic Primitives</B></a><br>
These primitives are defined in <tt>prims.c</tt>
<p><blockquote>
<tt>\exit</tt>  
        - Exits the guml script.
<p>
<tt>\param{<i>parameter</i>}</tt>
        - Returns the string value of <i>parameter</i>.  See example in paramcount below.
<p>
<tt>\paramcount</tt>
       - Returns the number of parameters to a macro.
<blockquote>
Example:<br> 
  <dd>\set{blah}{\quote{<br>
  <dd>\set{i}{1}<br>
  <dd>\while{<br>
  <dd>\op{\i}{<=}{\paramcount}<br>
  <dd>}{<br>
  <dd>\\param\{\i\} = \param{\i}<br>
  <dd>\set{i}{\op{\i}{+}{1}}
  <dd>}<br>
  <dd>}}<br>
  <br>
  <dd>\blah{1}{2}{3}{4}<br>
  <br>
Returns:<br>
  <dd>\param{1} = 1<br>
  <dd>\param{2} = 2<br>
  <dd>\param{3} = 3<br>
  <dd>\param{4} = 4<br>
  </blockquote>
<p>
</blockquote>
<a name="string"><B>String Primitives</B></a><br>
These primitives are defined in <tt>string_ops.c</tt>
<P>
<blockquote>
<TT>\strlength{<I>string</I>}</TT>
	- Returns the length of <TT><I>string</I></TT>

<blockquote>
Example: <TT>\strlength{two}</TT>
<P>
Returns: <TT>3</TT>
</blockquote>

<TT>\strindex{<I>string1</I>}{<I>string2</I>}</TT>
	- Returns the starting character position of <TT><I>string2</I></TT>
	  within <TT><I>string1</I></TT>.  Returns the empty string if not found.

<blockquote>
Example: <TT>\strindex{bladda}{adda}</TT>
<P>
Returns: <TT>2</TT>
</blockquote>

<TT>\substr{<I>string</I>}{<I>startpos</I>}{<I>length</I>}</TT>
	- Returns substring of length <TT><I>length</I></TT> starting at the
	  character position of <TT><I>startpos</I></TT>.  Returns the empty
	  string if not found.

<blockquote>
Example: <TT>\substr{yarf}{1}{3}</TT>
<P>
Returns: <TT>arf</TT>
</blockquote>

<TT>\strip{<I>string1</I>}{<I>string2</I>}</TT>
	- Returns <TT><I>string1</I></TT> after having stripped all of the
	  individual characters in <TT><I>string2</I></TT>.

<blockquote>
Example: <TT>\strip{whatever}{ev}</TT>
<P>
Returns: <TT>whatr</TT>
</blockquote>

<TT>\strtok{<I>string</I>}{<I>token</I>}</TT>
	- Returns the <TT><I>string</I></TT> up until <TT><I>token</I></TT>.
	  Returns the entire string if not found.

<blockquote>
Example: <TT>\strtok{rida-bike}{-}</TT>
<P>
Returns: <TT>rida</TT>
</blockquote>

<TT>\strupper{<I>string</I>}</TT>
	- Returns the capitalized <TT><I>string</I></TT>.

<blockquote>
Example: <TT>\strupper{no}</TT>
<P>
Returns: <TT>NO</TT>
</blockquote>

<TT>\strlower{<I>string</I>}</TT>
	- Returns the <TT><I>string</I></TT> in lower case.

<blockquote>
Example: <TT>\strlower{HAhaHA}</TT>
<P>
Returns: <TT>hahaha</TT>
</blockquote>

<TT>\date{<I>format</I>}{<I>time</I>}</TT>
	- Without any arguments, returns a date of the format: May 04, 1998.
	  The optional format string is the same as the C format string for date
	  (which is detailed in the man pages for &quot;date&quot;).  The second
	  optional argument is the unix time (seconds since Jan 01, 1970 0:00 GMT)
	  to convert (as in &quot;854523817&quot;--see <TT>\time</TT> for more
	  info), which defaults to the current time.

<blockquote>
Example: <TT>\date</TT>
<P>
Returns: <TT>May 04, 1998</TT>
<P>
Example: <TT>\date{%B %e, %Y}</TT>
<P>
Returns: <TT>May 4, 1998</TT>
<P>
Example: <TT>\date{DATE: %m/%d/%y -- TIME: %H:%M:%S}</TT>
<P>
Returns: <TT>DATE: 08/01/76 -- TIME: 14:45:05</TT>
<P>
Example: <TT>\date{}{865719873}</TT>
<P>
Returns: June 07, 1997
<P>
<I>Note that date formatting strings may not work under NT platforms the
same as they do for UNIX platforms.</I>

</blockquote>

<TT>\time{<I>format</I>}{<I>seconds</I>}</TT>
	- Without any arguments, returns the number of seconds since Jan 1st,
	  1970 0:00 GMT.  The optional parameters exist so that you may give it
	  the number of seconds and a date format string, and <TT>time</TT> will
	  give you the date.  See <TT>\date</TT>for more information on date
	  format strings.

<blockquote>
Example: <TT>\time</TT>
<P>
Returns: <TT>894310768</TT>
</blockquote>

<tt>\strsoundex{<i>name</i>}</tt>
        - Tanslates <i>name</i> into a 4 digit code consisting of 1 letter and 3 numbers.  See <a href="http://www.outfitters.com/genealogy/what-soundex.html">http://www.outfitters.com/genealogy/what-soundex.html</a>
<p>
<TT>\sqlquote{<I>string</I>}</TT>
	- Quotes a string.  That is, replaces the single quote character
	  &quot;<TT>'</TT>&quot; with two single quotes &quot;<tt>''</tt>&quot;.
	  This primitive is defined in sql_engine.c.  See Database 
          Connectivity (section VI) for more information on using
	  GUML with databases.

<blockquote>
Example: <TT>\sqlquote{ain't ain't a word!}</TT>
<P>
Result: <TT>ain''t ain''t a word!</TT>
</blockquote>

<TT>\htmlquote{<I>string</I>}</TT>
	- Quotes a string or a block of text to avoid any unwanted HTML parsing.

<blockquote>
Example: <TT>\htmlquote{&lt;img src=&quot;blah.jpg&quot;&gt;}</TT>
<P>
Result: <TT>&amp;lt;img src=&amp;quot;blah.jpg&amp;quot;&amp;gt;</TT>
</blockquote>
</blockquote>

<a name="math"><B>Math Primitives</B></a><br>
These primitives are defined in <tt>math_ops.c</tt>.
<p>
<blockquote>
If you've read Section IV on Operators,  you already
know how to use most GUML math primitives, and can look there
for more in-depth information.  The following is provided as a
quick reference.

<P>

<TT>\op{<I>val1</I>}{<I>op</I>}{<I>val2</I>}</TT>
	- Performs an integer operation.

<blockquote>
Example: <TT>\op{1}{+}{12}</TT>
<P>
Returns: <TT>13</TT>
</blockquote>

<TT>\fop{<I>val1</I>}{<I>op</I>}{<I>val2</I>}</TT>
	- Performs a floating-point operation.

<blockquote>
Example: <TT>\fop{1.666}{+}{12}</TT>
<P>
Returns: <TT>13.666</TT>
</blockquote>

<TT>\rand{<I>num</I>}</TT>
	- Returns a psuedo-random integer between 0 and <TT><I>num</I></TT>-1,
	  inclusive.

<blockquote>
Example: <TT>\rand{7}</TT>
<p>
Returns: Any number from 0 to 6, each with equal probability.
</blockquote>

<TT>\money{<I>string</I>}</TT>
	- Converts a money string into a floating point value by removing
	  dollar signs and commas.

<blockquote>
Example: <TT>\money{$12,123.60}</TT>
<P>
Returns: <TT>12123.60</TT>
</blockquote>
</blockquote>

<a name="file"><B>File Handling Primitives</B></a><br>
These primitives are defined in <tt>file_ops.c</tt>
<p>
<blockquote>
<tt>\filedelete</tt><P>
<tt>\filewrite</tt><P>
<tt>\fileread</tt><P>
<tt>\fileexists</tt><P>
<tt>\filestatus</tt><P>
<tt>\include</tt><P>
</blockquote>

These primitives are defined in <tt>filehandle_ops.c</tt>
<P>
<blockquote>
<TT>\open{<I>filename</I>}</TT>
	- Opens a file called <TT><I>filename</I></TT> for reading.  Returns a
	  filehandle string if successful, the empty string if not.
<P>
<TT>\output{<I>filename</I>}</TT>
	- Opens the file <TT><I>filename</I></TT> for output.  Returns a
	  filehandle string if successful, the empty string if not.
<P>
<TT>\append{<I>filename</I>}</TT>
	- Opens a file for appending to.  Returns a filehandle
	  string if successful, the empty string if not.
<P>
<TT>\close{<I>filehandle</I>}</TT>
	- Closes the file indicated by the filehandle <TT><I>filehandle</I></TT>.
<P>
<TT>\isopen{<I>filehandle</I>}</TT>
	- Returns true if the file indicated by the filehandle
	  <TT><I>filehandle</I></TT> is open, the empty string if not.
<P>
<TT>\readline{<I>filehandle</I>}</TT>
	- Reads a line of text in from the file indicated by the filehandle
	  <TT><I>filehandle</I></TT>.  If there is no text left in the file,
	  it is closed.
<P>
<TT>\writeline{<I>filehandle</I>}{<I>string</I>}</TT>
	- Outputs the contents of <TT><I>string</I></TT> to the opened file.

<blockquote>
Example:

<blockquote>
<pre>
\set{infile}{\open{infile.txt}}
\if{\not{\isopen{\get{infile}}}}{
  \error{sorry, the file "infile.txt" doesn't exist!}
}

\set{outfile}{\open{outfile.txt}}
\if{\isopen{\get{infile}}}{
  \error{sorry, the file "outfile.txt" already exists!}
}

\close{\get{outfile}}
\set{outfile}{\output{outfile.txt}}
\while{\isopen{\get{infile}}}{
  \writeline{\get{outfile}}{\readline{\get{infile}}}
}
</pre>
</blockquote>

Result: The file <tt>infile.txt</tt> (if it exists) is copied to the file
<tt>outfile.txt</tt> (if it doesn't already exist).
</blockquote>
</blockquote>

<a name="email"><B>Sendmail Primitive*</B></a><br>
This primitive is defined in <tt>email.c</tt>
<P>
<blockquote>
<TT>\email{<I>address</I>}{<I>messagebody</I></TT>}
	- Emails the contents of <TT><I>messagebody</I></TT> to the email address
	  <TT><I>address</I></TT>.  Lets you build the header in
	  <TT><I>messagebody</I></TT>.

<blockquote>
Example:
<blockquote>
<pre>
\email{schmuck@whereever.com}{
  From:
  To: schmuck@whereever.com
  Subject: Hello!

  Hello, shmuck!
}
</pre>
</blockquote>

By building your own header, you may also build multi-part mail messages,
like so:

<blockquote>
<pre>
\set{boundary}{}
\set{i}{0}
\while{\op{\i}{&lt;}{24}}{
  \set{boundary}{\get{boundary}\rand{10}}
  \inc{i}
}

\email{schmuck@whereever.com}{
  From:
  MIME-Version: 1.0
  To: schmuck@whereever.com
  Subject: You've got a graphic!
  Content-Type: multipart/alternative; boundary=&quot;--------\get{boundary}&quot;

  --------------\get{boundary}
  Content-type: text/plain; charset=us-ascii
  Content-Transfer-Encoding: 7bit

  Hello, shmuck!  You've got a card!

  --------------\get{boundary}
  Content-type: text/html; charset=us-ascii
  Content-Transfer-Encoding: 7bit

  &lt;HTML&gt;
  &lt;BODY BGCOLOR=&quot;\#ffffff&quot;&gt;
  &lt;CENTER&gt;
  &lt;P&gt;
  &lt;IMG SRC=&quot;http://www.someplace.com/card.gif&quot;&gt;
  &lt;P&gt;
  &lt;/CENTER&gt;
  &lt;/BODY&gt;
  &lt;/HTML&gt;

  --------------\get{boundary}-
}
</pre>
</blockquote>

</blockquote>
<blockquote>
<I>* Note that the email functionality is only available in UNIX versions of
GUML, and not supported in the PC-version, PUML</I>.
</blockquote>
</blockquote>

<a name="adding"><B>Adding Primitives</B></a>
<p>
<blockquote>
In any application it may be desirable to add additional 
commands to GUML which execute C code instead of simply more GUML code.  
This may be effected by adding appropriate entries to the header file 
<tt>guml.h</tt> and then writing a C function which accepts an array of 
arguments and returns a string which is the output of that command.  
All the primitives with the exception of <tt>\if</tt> and
<tt>\quote</tt> are implemented like this.
<p>
Such commands in existence include SQL interface and WWW processing
directives.
</blockquote>

</BODY>
</HTML>
